---
kind: type
id: T:Autodesk.Revit.DB.Structure.StirrupTieAttachmentType
source: html/01887c64-36b1-1f7f-5ff9-1fb3ba4f3023.htm
---
# Autodesk.Revit.DB.Structure.StirrupTieAttachmentType

An enumerated tye that represents how the Stirrup/Tie rebar is attached to the cover reference.

## Syntax (C#)
```csharp
public enum StirrupTieAttachmentType
```